{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Model", "config": {"output_layers": [["activation_49", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "resnet50", "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "conv1_pad", "trainable": true}, "name": "conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [7, 7], "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "conv1", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_conv1", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2a_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2a_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2a_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2a_branch1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch1", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2b_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}, "name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2b_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}, "name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2b_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}, "name": "activation_7", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2c_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}, "name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2c_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}, "name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res2c_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_10", "trainable": true}, "name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3a_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_11", "trainable": true}, "name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3a_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_12", "trainable": true}, "name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3a_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3a_branch1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch1", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true}, "name": "add_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_13", "trainable": true}, "name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3b_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_14", "trainable": true}, "name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3b_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_15", "trainable": true}, "name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3b_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true}, "name": "add_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_16", "trainable": true}, "name": "activation_16", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3c_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_17", "trainable": true}, "name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3c_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_18", "trainable": true}, "name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3c_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true}, "name": "add_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_19", "trainable": true}, "name": "activation_19", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3d_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_20", "trainable": true}, "name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3d_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_21", "trainable": true}, "name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res3d_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true}, "name": "add_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_22", "trainable": true}, "name": "activation_22", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4a_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_23", "trainable": true}, "name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4a_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_24", "trainable": true}, "name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4a_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4a_branch1", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch1", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true}, "name": "add_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_25", "trainable": true}, "name": "activation_25", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4b_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_26", "trainable": true}, "name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4b_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_27", "trainable": true}, "name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4b_branch2c", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2c", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9", "trainable": true}, "name": "add_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_28", "trainable": true}, "name": "activation_28", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4c_branch2a", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [1, 1], "data_format": "channels_last", "padding": "valid", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2a", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_29", "trainable": true}, "name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4c_branch2b", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}, "name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2b", "trainable": true, "center": true, "momentum": 0.99, "axis": 3, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_30", "trainable": true}, "name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "res4c_branch2c", "bias_regularizer": null, 